import React from 'react';

const mockSortedTask = [
  {
    date: '7/22/2021',
    dateISO: '2021-07-22T12:41:27.822Z',
    mainTaskList: [
      {
        _id: '60f96776d04b9328060c30cf',
        at: '2021-07-22T12:41:27.822Z',
        name: 'Работа над shortCut',
        start: '2021-07-22T12:41:22.258Z',
        stop: '2021-07-22T12:41:26.822Z',
        duration: 2068269,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f96776d04b9328060c30cf',
            start: '2021-07-22T12:41:22.258Z',
            stop: '2021-07-22T12:41:26.822Z',
          },
          {
            _id: '60f9676dd04b9328060c30c9',
            start: '2021-07-22T12:41:14.491Z',
            stop: '2021-07-22T12:41:17.670Z',
          },
          {
            _id: '60f96739dc208626db89ae66',
            start: '2021-07-22T12:40:23.672Z',
            stop: '2021-07-22T12:40:25.535Z',
          },
          {
            _id: '60f96731dc208626db89ae5f',
            start: '2021-07-22T12:28:58.748Z',
            stop: '2021-07-22T12:40:17.516Z',
          },
          {
            _id: '60f95703e2817f447000a657',
            start: '2021-07-22T11:08:15.074Z',
            stop: '2021-07-22T11:31:14.969Z',
          },
        ],
      },
      {
        _id: '60f94fc8e2817f447000a5fe',
        at: '2021-07-22T11:00:25.527Z',
        name: 'Задача: Опитизация загрузки сайта Белый Уголь',
        start: '2021-07-22T10:57:02.184Z',
        stop: '2021-07-22T11:00:24.527Z',
        duration: 202343,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f94ed4e2817f447000a5f7',
        at: '2021-07-22T10:56:21.451Z',
        name: 'Проверка дублей GTM и GA на сайтах Rusfic',
        start: '2021-07-22T10:37:24.650Z',
        stop: '2021-07-22T10:56:20.451Z',
        duration: 1135801,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f949d2e2817f447000a5f0',
        at: '2021-07-22T10:34:59.725Z',
        name: 'Задача: Опитизация загрузки сайта Прокто-Гливенол',
        start: '2021-07-22T10:25:18.081Z',
        stop: '2021-07-22T10:34:58.725Z',
        duration: 6658052,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f949d2e2817f447000a5f0',
            start: '2021-07-22T10:25:18.081Z',
            stop: '2021-07-22T10:34:58.725Z',
          },
          {
            _id: '60f94566e2817f447000a5e2',
            start: '2021-07-22T09:41:45.076Z',
            stop: '2021-07-22T10:16:06.174Z',
          },
          {
            _id: '60f93aa6e2817f447000a5db',
            start: '2021-07-22T08:27:14.587Z',
            stop: '2021-07-22T09:30:14.840Z',
          },
          {
            _id: '60f92973e2817f447000a5ce',
            start: '2021-07-22T08:12:55.096Z',
            stop: '2021-07-22T08:16:51.153Z',
          },
        ],
      },
      {
        _id: '60f9478be2817f447000a5e9',
        at: '2021-07-22T10:25:16.529Z',
        name: 'Coffee time',
        start: '2021-07-22T10:16:12.546Z',
        stop: '2021-07-22T10:25:15.529Z',
        duration: 542983,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f92677e2817f447000a5c5',
        at: '2021-07-22T08:04:08.767Z',
        name: 'Задача: Опитизация загрузки сайта Клималанин',
        start: '2021-07-22T07:44:31.462Z',
        stop: '2021-07-22T08:04:07.767Z',
        duration: 1449533,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f92677e2817f447000a5c5',
            start: '2021-07-22T07:44:31.462Z',
            stop: '2021-07-22T08:04:07.767Z',
          },
          {
            _id: '60f91de2871274377d24b3f5',
            start: '2021-07-22T07:23:02.170Z',
            stop: '2021-07-22T07:27:30.107Z',
          },
          {
            _id: '60f91c2b871274377d24b3ee',
            start: '2021-07-22T07:20:06.314Z',
            stop: '2021-07-22T07:20:11.605Z',
          },
        ],
      },
    ],
  },
  {
    date: '7/21/2021',
    dateISO: '2021-07-21T14:25:15.648Z',
    mainTaskList: [
      {
        _id: '60f82e4a331d3199ca823d9b',
        at: '2021-07-21T14:25:15.648Z',
        name: 'Задача: Скрыть текст на ДП и ИП',
        start: '2021-07-21T14:14:21.685Z',
        stop: '2021-07-21T14:25:14.648Z',
        duration: 652963,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f82b00331d3199ca823d8e',
        at: '2021-07-21T14:11:13.727Z',
        name: 'Задача: Нейроуридин// Сайт/ Отображение логотипов в разделе Где купить',
        start: '2021-07-21T14:05:23.030Z',
        stop: '2021-07-21T14:11:12.727Z',
        duration: 648315,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f82b00331d3199ca823d8e',
            start: '2021-07-21T14:05:23.030Z',
            stop: '2021-07-21T14:11:12.727Z',
          },
          {
            _id: '60f81330d5c1a01a9940c2cf',
            start: '2021-07-21T12:24:37.915Z',
            stop: '2021-07-21T12:29:36.533Z',
          },
        ],
      },
      {
        _id: '60f81dc3d5c1a01a9940c2d6',
        at: '2021-07-21T13:14:44.691Z',
        name: 'Задача: Опитизация загрузки сайта Карнитон',
        start: '2021-07-21T12:34:52.187Z',
        stop: '2021-07-21T13:14:43.691Z',
        duration: 2480027,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f81dc3d5c1a01a9940c2d6',
            start: '2021-07-21T12:34:52.187Z',
            stop: '2021-07-21T13:14:43.691Z',
          },
          {
            _id: '60f7fdded5c1a01a9940c2b2',
            start: '2021-07-21T10:57:10.201Z',
            stop: '2021-07-21T10:58:38.724Z',
          },
        ],
      },
      {
        _id: '60f80019d5c1a01a9940c2c8',
        at: '2021-07-21T11:08:10.587Z',
        name: 'Задача: Детримакс // правки на сайт',
        start: '2021-07-21T11:03:35.734Z',
        stop: '2021-07-21T11:08:09.587Z',
        duration: 273853,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f7fec5d5c1a01a9940c2b9',
        at: '2021-07-21T11:02:30.556Z',
        name: 'Задача: Изменение текста на сайте omnicomm-monitoring .ru',
        start: '2021-07-21T10:59:16.330Z',
        stop: '2021-07-21T11:02:29.556Z',
        duration: 356425,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f7fec5d5c1a01a9940c2b9',
            start: '2021-07-21T10:59:16.330Z',
            stop: '2021-07-21T11:02:29.556Z',
          },
          {
            _id: '60f7fd6cd5c1a01a9940c2ab',
            start: '2021-07-21T10:54:01.290Z',
            stop: '2021-07-21T10:56:44.489Z',
          },
        ],
      },
      {
        _id: '60f7fc8fd5c1a01a9940c2a4',
        at: '2021-07-21T10:53:04.513Z',
        name: 'Задача: Опитизация загрузки сайта Веторон',
        start: '2021-07-21T10:31:57.271Z',
        stop: '2021-07-21T10:53:03.513Z',
        duration: 1266242,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f7f575d5c1a01a9940c29d',
        at: '2021-07-21T10:22:46.784Z',
        name: 'Задача: Установить фавиконы на сайты Алфавит, Карнитон, Гаксализ, Клималанин и Кудесан',
        start: '2021-07-21T10:04:45.664Z',
        stop: '2021-07-21T10:22:45.784Z',
        duration: 1080120,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f7ee48d5c1a01a9940c296',
        at: '2021-07-21T09:52:09.531Z',
        name: 'Задача: Задачи по ITSOFT // мелкие правки',
        start: '2021-07-21T09:46:34.632Z',
        stop: '2021-07-21T09:52:08.531Z',
        duration: 357553,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f7ee48d5c1a01a9940c296',
            start: '2021-07-21T09:46:34.632Z',
            stop: '2021-07-21T09:52:08.531Z',
          },
          {
            _id: '60f7ecf7d5c1a01a9940c28f',
            start: '2021-07-21T09:46:07.795Z',
            stop: '2021-07-21T09:46:31.449Z',
          },
        ],
      },
      {
        _id: '60f7ea7cd5c1a01a9940c288',
        at: '2021-07-21T09:35:57.337Z',
        name: 'Задача: Добавить на тестовую копию Детримакс баннер по макетам',
        start: '2021-07-21T09:00:13.656Z',
        stop: '2021-07-21T09:35:56.337Z',
        duration: 6492441,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f7ea7cd5c1a01a9940c288',
            start: '2021-07-21T09:00:13.656Z',
            stop: '2021-07-21T09:35:56.337Z',
          },
          {
            _id: '60f7e0ccd5c1a01a9940c279',
            start: '2021-07-21T07:42:06.103Z',
            stop: '2021-07-21T08:54:35.863Z',
          },
        ],
      },
      {
        _id: '60f7cf89d5c1a01a9940c272',
        at: '2021-07-21T07:40:58.752Z',
        name: 'Coffee time',
        start: '2021-07-21T07:27:58.123Z',
        stop: '2021-07-21T07:40:57.752Z',
        duration: 779629,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
    ],
  },
  {
    date: '7/20/2021',
    dateISO: '2021-07-20T19:23:46.041Z',
    mainTaskList: [
      {
        _id: '60f722c182fce10428ce5ddb',
        at: '2021-07-20T19:23:46.041Z',
        name: 'Coffee time',
        start: '2021-07-20T19:23:42.793Z',
        stop: '2021-07-20T19:23:45.041Z',
        duration: 1272915,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f722c182fce10428ce5ddb',
            start: '2021-07-20T19:23:42.793Z',
            stop: '2021-07-20T19:23:45.041Z',
          },
          {
            _id: '60f6cb1960d2af111f88cb4f',
            start: '2021-07-20T12:57:44.632Z',
            stop: '2021-07-20T13:09:45.395Z',
          },
          {
            _id: '60f68ba860d2af111f88ca73',
            start: '2021-07-20T08:29:54.755Z',
            stop: '2021-07-20T08:39:04.659Z',
          },
        ],
      },
      {
        _id: '60f6dd4960d2af111f88cb5f',
        at: '2021-07-20T14:27:22.455Z',
        name: 'Задача: Исправить в мета-тегах название справа в соц. сетях SpecTransExpo',
        start: '2021-07-20T14:22:25.323Z',
        stop: '2021-07-20T14:27:21.455Z',
        duration: 296132,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f6d9c560d2af111f88cb56',
        at: '2021-07-20T14:12:22.518Z',
        name: 'Задача: Опитизация загрузки сайта Веторон',
        start: '2021-07-20T13:09:51.663Z',
        stop: '2021-07-20T14:12:21.518Z',
        duration: 3749855,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f6c5f260d2af111f88cb44',
        at: '2021-07-20T12:47:47.458Z',
        name: 'Задача: Опитизация загрузки сайта Алфавит',
        start: '2021-07-20T12:40:48.759Z',
        stop: '2021-07-20T12:47:46.458Z',
        duration: 6564572,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
        time: [
          {
            _id: '60f6c5f260d2af111f88cb44',
            start: '2021-07-20T12:40:48.759Z',
            stop: '2021-07-20T12:47:46.458Z',
          },
          {
            _id: '60f6b33360d2af111f88cb3d',
            start: '2021-07-20T09:45:20.150Z',
            stop: '2021-07-20T11:27:47.023Z',
          },
        ],
      },
      {
        _id: '60f698b160d2af111f88cb0c',
        at: '2021-07-20T09:34:42.376Z',
        name: 'Работа над проектом timesUp',
        start: '2021-07-20T08:39:13.241Z',
        stop: '2021-07-20T09:34:41.376Z',
        duration: 3328135,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
      {
        _id: '60f686a860d2af111f88ca4c',
        at: '2021-07-20T08:17:44.981Z',
        name: 'Задача: Установка Google Tag Manager',
        start: '2021-07-20T08:04:40.821Z',
        stop: '2021-07-20T08:17:43.981Z',
        duration: 783160,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
    ],
  },
  {
    date: '7/19/2021',
    dateISO: '2021-07-19T16:10:45.263Z',
    mainTaskList: [
      {
        _id: '60f5a404a4801d0e11aa524a',
        at: '2021-07-19T16:10:45.263Z',
        name: 'Coffee time',
        start: '2021-07-19T16:10:38.330Z',
        stop: '2021-07-19T16:10:44.263Z',
        duration: 5933,
        userID: '60d9a4baf792b239f0574760',
        __v: 0,
      },
    ],
  },
];

export const SearchResult = () => {
  return (
    <div>
      <div>
        <p>Итого?</p>
        <p>Среднее?</p>
      </div>

      <div>Таблица</div>
    </div>
  );
};
